
print(''' 
 _  __             _                     _____  _                                    _                __   
| |/ / _ __  __ _ | |_  ___   ___       |_   _|| |__    ___         __ _   ___    __| |        ___   / _|  
| ' / | '__|/ _` || __|/ _ \ / __|        | |  | '_ \  / _ \       / _` | / _ \  / _` |       / _ \ | |_   
| . \ | |  | (_| || |_| (_) |\__ \        | |  | | | ||  __/      | (_| || (_) || (_| |      | (_) ||  _|  
|_|\_\|_|   \__,_| \__|\___/ |___/        |_|  |_| |_| \___|       \__, | \___/  \__,_|       \___/ |_|    
__      __ __ _  _ __                                              |___/                                   
\ \ /\ / // _` || '__|                                                                                     
 \ V  V /| (_| || |                                                                                        
  \_/\_/  \__,_||_|                                                                                                                                                              
''')















print('''    
      
      
      
      
      
      
      
                                                                                       ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ                                                                                    
                                                                                 ÆÆÆÆÆÆÆÆ              ÆÆÆÆÆÆÆÆ                                                                              
                                                                              ÆÆÆÆÆ                          ÆÆÆÆÆ                                                                           
                                                                           ÆÆÆÆ                                 ÆÆÆÆÆ                                                                        
                                                                        ÆÆÆÆ                                       ÆÆÆÆÆ                                                                     
                                                                      ÆÆÆÆ                                       Æ    ÆÆÆÆ                                                                   
                                                                     ÆÆÆ                                         ÆÆÆÆ   ÆÆÆ                                                                  
                                                                   ÆÆÆ                                        ÆÆ Æ   ÆÆ   ÆÆÆ                                                                
                                                                  ÆÆ                                                   Æ    ÆÆÆ                                                              
                                                                ÆÆÆ                                                     ÆÆ   ÆÆÆ                                                             
                                                               ÆÆ                                                 Æ    ÆÆ      ÆÆ                                                            
                                                              ÆÆ                                               ÆÆ     Æ         ÆÆ                                                           
                                                              ÆÆ                                                 ÆÆ ÆÆ           Æ                                                           
                                                             ÆÆ                                                     Æ            ÆÆ                                                          
                                                            ÆÆ                                                   ÆÆÆ              ÆÆ                                                         
                                                            Æ                                                      Æ               Æ                                                         
                                                            Æ                                                 ÆÆÆÆÆÆ               Æ                                                         
                                                           ÆÆ                                                ÆÆ   Æ                ÆÆ                                                        
                                                           ÆÆ                                             ÆÆÆ    Æ                 ÆÆ                                                        
                                                           Æ                                                     Æ                 ÆÆ                                                        
                                                           ÆÆ                                       ÆÆÆÆÆ       Æ                  ÆÆ                                                        
                                                           ÆÆ                                                  ÆÆ                  ÆÆ                                                        
                                                           ÆÆ                                     ÆÆ ÆÆÆ Æ ÆÆ  Æ                    Æ                                                        
                                                           ÆÆ                                    ÆÆ          ÆÆÆ                   ÆÆ                                                        
                                                            Æ                        Æ          Æ ÆÆ    Æ  Æ                       ÆÆ                                                        
                                                            Æ                                  Æ ÆÆ   ÆÆ                           Æ                                                         
                                                            Æ                                        Æ       ÆÆÆ       Æ           Æ                                                         
                                                       ÆÆÆÆÆÆ         ÆÆÆ                                ÆÆÆ   ÆÆ    ÆÆÆÆÆÆ      Æ ÆÆÆÆÆÆ                                                    
                                                      ÆÆ              ÆÆÆÆÆÆÆÆ                         ÆÆ          ÆÆÆÆÆÆÆÆÆ     Æ      ÆÆ                                                   
                                                      Æ  Æ                  ÆÆÆÆ                              Æ  ÆÆÆ  Æ    Æ           Æ Æ                                                   
                                                      Æ Æ                    ÆÆÆÆÆÆÆÆ                      ÆÆÆÆÆÆÆ       Æ Æ      ÆÆ Æ Æ Æ                                                   
                                                      Æ   ÆÆ             ÆÆÆÆ ÆÆÆÆÆÆÆÆÆÆÆ     ÆÆ   ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ  ÆÆ Æ        ÆÆÆÆ   Æ                                                   
                                                      Æ   Æ              ÆÆÆ    Æ Æ    ÆÆÆÆÆÆÆÆÆ   ÆÆÆ  ÆÆÆÆ  Æ Æ  Æ  Æ   ÆÆ     Æ   ÆÆ  Æ                                                   
                                                      ÆÆ     Æ             ÆÆÆÆÆÆÆÆÆÆ  ÆÆÆÆÆÆ      ÆÆÆÆÆÆ  ÆÆÆÆÆÆÆÆÆÆÆÆÆ          ÆÆ    ÆÆ                                                   
                                                      ÆÆ    ÆÆÆ             Æ    Æ ÆÆÆÆÆÆÆ             ÆÆÆÆÆÆÆÆÆÆ ÆÆÆÆ Æ         ÆÆÆÆÆ  Æ                                                    
                                                       ÆÆ  ÆÆÆ               Æ ÆÆÆÆÆÆÆ                         Æ   ÆÆÆ  Æ         ÆÆÆÆ ÆÆ                                                    
                                                        Æ    Æ              ÆÆ                            Æ      ÆÆ      Æ         Æ   Æ                                                     
                                                        ÆÆ                  Æ                               Æ         ÆÆÆÆÆ      Æ    ÆÆ                                                     
                                                         Æ                                                   ÆÆÆ   Æ Æ    ÆÆ         ÆÆ                                                      
                                                         ÆÆ                                          ÆÆ       ÆÆÆÆ  Æ   Æ  ÆÆ      Æ ÆÆ                                                      
                                 ÆÆÆÆÆ                    ÆÆ                                             ÆÆ   Æ       ÆÆÆÆÆÆ  Æ     ÆÆ                                                       
                                ÆÆ   Æ                    ÆÆÆ         Æ  Æ          ÆÆ                    ÆÆÆ  ÆÆÆÆÆ ÆÆÆÆÆÆ  Æ     ÆÆÆ                                                       
                               ÆÆ   ÆÆ                      ÆÆÆ         ÆÆ        ÆÆÆ                      ÆÆÆ Æ  ÆÆÆ ÆÆÆ     Æ  ÆÆÆ                                                         
                             ÆÆÆ    ÆÆ                        Æ                  ÆÆ                     ÆÆ   ÆÆ      ÆÆÆ   Æ   Æ ÆÆ                                                          
                            ÆÆÆ     Æ                         Æ           ÆÆ    ÆÆ      ÆÆ           ÆÆÆÆÆ    ÆÆ    ÆÆ   Æ       ÆÆ                                                          
                          ÆÆÆ      ÆÆ                         Æ                 Æ          Æ       ÆÆÆÆ        ÆÆÆ  ÆÆ    Æ Æ     Æ                                                          
                         ÆÆÆ  Æ    ÆÆ                         Æ                               ÆÆÆÆÆ      ÆÆ      ÆÆÆÆ  Æ  Æ Æ     Æ                                                          
                       ÆÆÆ    Æ    Æ                          Æ                                             ÆÆÆ   ÆÆÆ             Æ                                                          
                      ÆÆÆ  Æ  Æ    Æ                          Æ                                                  ÆÆÆ    Æ  ÆÆ ÆÆ ÆÆ                                                          
                  ÆÆÆÆÆ            Æ                    ÆÆÆÆÆÆÆ                         ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ    Æ  ÆÆ      ÆÆ    ÆÆÆÆÆÆ                                                       
              ÆÆÆÆÆÆ       ÆÆ     ÆÆ            ÆÆÆÆÆÆÆÆÆ                           ÆÆÆÆÆÆ     ÆÆÆ      ÆÆÆÆÆÆ Æ  ÆÆÆ ÆÆÆ     ÆÆ     ÆÆÆÆÆÆÆÆ                                                
          ÆÆÆÆÆÆ          Æ  Æ    ÆÆ      ÆÆÆÆÆÆÆÆ                                ÆÆÆ                       ÆÆÆÆÆ            ÆÆ            ÆÆÆÆÆÆÆÆ                                          
   ÆÆÆÆÆÆÆÆÆ          ÆÆ     Æ    ÆÆ  ÆÆÆÆÆÆ                                                       Æ Æ                      ÆÆÆ                   ÆÆÆÆÆ                                      
  ÆÆ    ÆÆ          Æ        Æ    ÆÆÆÆÆÆ                            Æ                   ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ Æ          Æ   ÆÆ                         ÆÆÆÆ                                   
 ÆÆ                       Æ  Æ    Æ                                   Æ                   ÆÆÆ            ÆÆ Æ         Æ  ÆÆÆ                             ÆÆÆÆÆ                               
 Æ                        Æ  Æ    Æ                                     Æ           ÆÆÆÆÆÆÆ ÆÆÆ    ÆÆÆÆÆÆÆÆ  Æ  ÆÆ   ÆÆÆÆ                                    ÆÆÆÆÆ                           
ÆÆ    Æ                      Æ  Æ Æ       ÆÆ                              ÆÆ          Æ       ÆÆ  ÆÆ      ÆÆÆÆÆÆ    ÆÆ     Æ      Æ                    Æ         ÆÆÆÆÆ                       
Æ     Æ                 ÆÆ Æ Æ    Æ                                        ÆÆ                 ÆÆ  ÆÆ        ÆÆÆÆ Æ ÆÆ     Æ                            ÆÆÆÆ          ÆÆÆÆÆÆ                  
Æ    Æ                 ÆÆÆÆÆÆÆ    Æ Æ ÆÆ                                       ÆÆÆ             ÆÆÆÆ           ÆÆÆÆÆÆ                                   Æ ÆÆÆ       Æ       ÆÆÆÆÆÆÆÆ          
     Æ               ÆÆÆ          Æ                                        Æ    ÆÆÆÆ           Æ Æ           ÆÆÆÆÆ     Æ            Æ                  Æ ÆÆ Æ ÆÆ    ÆÆ            ÆÆÆÆÆÆ     
     Æ         ÆÆÆ  ÆÆ ÆÆ   ÆÆ   ÆÆ                                               ÆÆÆÆÆÆÆ    ÆÆÆ  ÆÆ      ÆÆÆÆÆÆ    Æ              ÆÆÆ       Æ        ÆÆÆ  ÆÆ        ÆÆÆ               ÆÆÆÆÆ 
     Æ ÆÆÆÆÆ ÆÆÆ ÆÆÆ        Æ    ÆÆ                                            ÆÆÆÆÆ  Æ ÆÆÆÆÆ     ÆÆÆÆÆÆÆÆÆ   Æ   ÆÆÆÆÆ          Æ  ÆÆ                ÆÆ ÆÆ    ÆÆ ÆÆÆÆ ÆÆÆÆÆÆ     ÆÆ         
    ÆÆÆÆ   ÆÆÆ        ÆÆÆ        ÆÆ                                               ÆÆ  Æ Æ   ÆÆÆÆÆÆÆ  Æ        Æ ÆÆÆÆÆÆ               Æ    Æ           Æ    Æ Æ    ÆÆ        ÆÆ       Æ   ÆÆ  
    ÆÆÆÆÆÆ          ÆÆ      Æ    ÆÆ         Æ                                      ÆÆ       ÆÆÆÆ              ÆÆ                                     ÆÆÆ          ÆÆ          Æ ÆÆ         Æ 
    ÆÆ   Æ            ÆÆ    ÆÆ   ÆÆ                                                ÆÆ           ÆÆ            Æ  Æ                                  ÆÆÆ  ÆÆ     Æ  ÆÆÆÆ         ÆÆÆÆÆÆÆ  ÆÆÆ 
     Æ   Æ         Æ   ÆÆ   ÆÆ   ÆÆ                                                 ÆÆÆ     ÆÆ              ÆÆÆÆ       Æ  ÆÆ  Æ     Æ Æ             Æ  Æ ÆÆÆ      Æ    Æ             ÆÆ ÆÆ   
    ÆÆ   ÆÆÆ      Æ ÆÆ  Æ   Æ    Æ                                                    ÆÆ                   ÆÆ         Æ         Æ                    Æ  Æ      Æ    ÆÆÆÆÆÆÆ            ÆÆ    
    ÆÆ ÆÆ  Æ      Æ  Æ  Æ   Æ    Æ                                                     ÆÆÆÆÆ             ÆÆÆ    Æ                 ÆÆ               Æ  Æ ÆÆÆ            Æ  ÆÆ    ÆÆÆÆÆ ÆÆ     
    ÆÆÆ Æ  ÆÆ     Æ    ÆÆ  Æ     Æ               Æ                                        ÆÆÆ          ÆÆÆ   Æ        ÆÆ           Æ               Æ      Æ ÆÆ     Æ       ÆÆ       ÆÆÆ      
     ÆÆ     Æ     ÆÆ   Æ   Æ     Æ       ÆÆÆ                                               ÆÆÆÆ        Æ  ÆÆ    Æ        ÆÆ    ÆÆ   Æ             ÆÆÆ ÆÆÆÆÆ   Æ             ÆÆÆÆ  Æ  ÆÆ      
     ÆÆ  Æ  Æ ÆÆ ÆÆÆ  Æ    Æ     Æ              Æ                                             ÆÆÆÆ     ÆÆÆ    ÆÆ                Æ  ÆÆ            ÆÆ Æ   Æ        ÆÆÆ             Æ  ÆÆ       
     ÆÆ    ÆÆÆÆ  ÆÆ   ÆÆ   Æ     Æ                 Æ                                             ÆÆÆÆ    ÆÆÆÆÆ         Æ  Æ  Æ           Æ       ÆÆ Æ  Æ                  ÆÆÆ      ÆÆ        
     ÆÆ    ÆÆÆ   ÆÆ       Æ      Æ       Æ                                                    ÆÆ  Æ ÆÆÆÆÆÆÆÆÆ            Æ  Æ       Æ Æ          ÆÆ  ÆÆ            Æ ÆÆÆÆ     ÆÆÆÆÆÆ         
      Æ   ÆÆÆ  ÆÆ Æ   Æ Æ Æ      ÆÆÆÆÆ                                                           ÆÆÆ                   ÆÆÆÆ  Æ               Æ  Æ Æ   ÆÆÆ      Æ ÆÆÆÆ ÆÆÆ  ÆÆÆÆ  ÆÆ          
     ÆÆÆ        Æ ÆÆ ÆÆÆ  Æ      ÆÆÆÆÆÆÆ         ÆÆ ÆÆ                                                   ÆÆÆÆ        ÆÆ   Æ      Æ              Æ Æ    Æ         ÆÆÆÆÆ Æ  Æ     ÆÆ           
      Æ     ÆÆ    ÆÆ     ÆÆ      Æ ÆÆÆ  Æ   Æ Æ Æ    ÆÆ                                                 ÆÆ     Æ Æ   Æ                 Æ     Æ  ÆÆ     ÆÆ     ÆÆÆÆ     ÆÆÆÆÆÆÆ ÆÆ            
          Æ  Æ     Æ   ÆÆ        Æ  ÆÆÆÆÆÆÆ   ÆÆ   ÆÆ                                                ÆÆÆ          ÆÆ Æ            Æ    Æ        ÆÆ      ÆÆÆÆÆÆÆ       ÆÆÆÆÆ ÆÆÆÆ             
       Æ  Æ    ÆÆÆÆÆ    Æ Æ      Æ       ÆÆÆÆÆ   ÆÆ Æ                                              ÆÆÆÆÆ             ÆÆÆÆÆ           Æ   Æ     ÆÆÆÆÆ            ÆÆÆÆÆÆÆ                      
 Æ     Æ  ÆÆÆÆ     Æ   ÆÆ Æ   Æ  Æ Æ Æ ÆÆ     ÆÆ                                                 Æ                ÆÆ  Æ           Æ         Æ                       ÆÆÆ                      
 Æ     Æ   Æ       Æ    Æ Æ   Æ Æ                 Æ                                                               Æ  Æ           ÆÆÆ          ÆÆ ÆÆÆÆÆÆÆ      ÆÆÆÆ Æ     Æ                   
 Æ     Æ     Æ     Æ    ÆÆ Æ ÆÆ Æ  ÆÆÆ     Æ                                                                      Æ      Æ Æ Æ       Æ  ÆÆ    ÆÆ              Æ  ÆÆ       Æ                  
 Æ     Æ   ÆÆ      ÆÆ   Æ    Æ  Æ                                                                                       Æ  ÆÆ    Æ   Æ       ÆÆ  ÆÆ    Æ      ÆÆÆ ÆÆÆÆÆ ÆÆ                   
 Æ         ÆÆ       Æ  Æ ÆÆ  Æ        Æ                                                                                    Æ ÆÆÆ    Æ        Æ       ÆÆ       Æ   ÆÆÆÆ Æ                     
 Æ     Æ             ÆÆ  Æ   Æ Æ                                                                                                 Æ           Æ ÆÆ    Æ    Æ Æ ÆÆ        Æ                    
 Æ     ÆÆ   Æ        Æ  ÆÆ   ÆÆÆ                                                                                              ÆÆ     ÆÆ Æ   Æ ÆÆÆÆÆÆ  ÆÆÆÆ ÆÆÆÆÆ ÆÆ   ÆÆ                     
 Æ     Æ    ÆÆ               ÆÆÆ                                                             Æ                                             ÆÆÆÆÆ     ÆÆ               ÆÆ                     
 Æ     Æ    ÆÆ                Æ                                                                                                            Æ      ÆÆ Æ    Æ ÆÆÆ      ÆÆ                      
 Æ     ÆÆ   ÆÆ              Æ Æ                                                               Æ                                           ÆÆÆ    Æ  ÆÆÆ             ÆÆ                       
      ÆÆÆ             Æ      ÆÆ                                                              ÆÆ                                          ÆÆ     Æ ÆÆ                ÆÆ                       
   Æ  ÆÆÆ                    Æ                                                                                                           Æ ÆÆ                      ÆÆ                        
   Æ    Æ                   ÆÆ                                                               ÆÆ                                          Æ   Æ                     Æ                         
  ÆÆ   ÆÆÆ          Æ      ÆÆ                                                                                                          Æ ÆÆ  Æ            Æ       ÆÆ                         
   ÆÆ    Æ  Æ         Æ   ÆÆ                                                                ÆÆ                                           Æ Æ                     ÆÆ                          
  Æ     ÆÆ  Æ      Æ      Æ                                                                                                          ÆÆÆ ÆÆ ÆÆ            ÆÆ                               Æ 
 Æ  Æ              Æ     ÆÆ                                                                                                                                   ÆÆÆÆ                           
 ÆÆ       Æ             ÆÆ                                                                                                          Æ   ÆÆÆÆÆ Æ        ÆÆ Æ ÆÆ                               
  Æ       Æ  Æ     Æ   ÆÆ                                                                                                                Æ     ÆÆ   ÆÆ    ÆÆ                             ÆÆ  
  ÆÆ              ÆÆ  ÆÆ                                                                                                                    ÆÆÆÆ  ÆÆ   ÆÆ ÆÆ   Æ                             
  ÆÆÆ     ÆÆ Æ Æ  Æ  ÆÆ                                                                                                                      Æ  Æ  Æ                                      Æ  
 ÆÆÆÆ     ÆÆ   ÆÆ   ÆÆ                                                                                                                      Æ      Æ                                  ÆÆ  Æ  
    ÆÆ   Æ        ÆÆÆ                                                                                                                             Æ            Æ                     Æ Æ  ÆÆ 
     Æ           ÆÆÆ                                                                                                                                Æ                                  Æ  Æ  
     ÆÆ        Æ ÆÆ                                                                                                                          Æ                                         Æ Æ   
   Æ  Æ   Æ   ÆÆÆÆ                                                                                                                                                                       ÆÆ  
      ÆÆ   Æ ÆÆÆÆ                                                                                                                                                                            
 Æ ÆÆÆÆÆÆ ÆÆ ÆÆÆ                                                                                                                                                                        Æ ÆÆ 
    ÆÆ ÆÆ  ÆÆÆ                                                                                                                                                                       Æ ÆÆÆ   
 ÆÆÆÆÆÆ Æ                                                                                                                                          Æ Æ   Æ                             Æ  ÆÆ 
    Æ Æ ÆÆ                                                                                                                                       Æ ÆÆ                              Æ  ÆÆ  Æ  
                                                                                                                                                                                     Æ       ''')